In [1]:
import pandas as pd

In [2]:
a = pd.Series([1,2,3,4,5])

In [3]:
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
type(a)

pandas.core.series.Series

In [5]:
a = pd.Series(['a','b','c'])

In [6]:
a

0    a
1    b
2    c
dtype: object

In [7]:
a = pd.date_range(start = '01-01-2019', end = '25-5-2019')

In [8]:
a

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10',
               ...
               '2019-05-16', '2019-05-17', '2019-05-18', '2019-05-19',
               '2019-05-20', '2019-05-21', '2019-05-22', '2019-05-23',
               '2019-05-24', '2019-05-25'],
              dtype='datetime64[ns]', length=145, freq='D')

In [9]:
type(a)

pandas.core.indexes.datetimes.DatetimeIndex

# Pandas Dataframe

In [10]:
import numpy as np

In [11]:
temp = np.random.randint(low = 20, high = 100, size = [20,])
name = np.random.choice(['Ahraar','Machine','Learning','Android','Rocks'],20)
random = np.random.choice([10,11,13,12,14],20)

In [12]:
a = list(zip(temp, name, random))

In [13]:
df = pd.DataFrame(data = a, columns = ['temp','name','random'])

In [14]:
df

    temp      name  random
0     43  Learning      13
1     99  Learning      12
2     70     Rocks      11
3     72    Ahraar      14
4     26    Ahraar      14
5     74     Rocks      11
6     72   Machine      11
7     76   Machine      10
8     99    Ahraar      11
9     50   Android      14
10    27  Learning      12
11    44  Learning      13
12    27   Android      10
13    80   Machine      14
14    90     Rocks      14
15    64     Rocks      10
16    90  Learning      12
17    70    Ahraar      11
18    83  Learning      12
19    81   Machine      13

In [15]:
df.head()

   temp      name  random
0    43  Learning      13
1    99  Learning      12
2    70     Rocks      11
3    72    Ahraar      14
4    26    Ahraar      14

In [16]:
df.tail()

    temp      name  random
15    64     Rocks      10
16    90  Learning      12
17    70    Ahraar      11
18    83  Learning      12
19    81   Machine      13

In [17]:
df.shape

(20, 3)

In [18]:
df.columns

Index(['temp', 'name', 'random'], dtype='object')

In [19]:
df.name

0     Learning
1     Learning
2        Rocks
3       Ahraar
4       Ahraar
5        Rocks
6      Machine
7      Machine
8       Ahraar
9      Android
10    Learning
11    Learning
12     Android
13     Machine
14       Rocks
15       Rocks
16    Learning
17      Ahraar
18    Learning
19     Machine
Name: name, dtype: object

In [20]:
df['name']

0     Learning
1     Learning
2        Rocks
3       Ahraar
4       Ahraar
5        Rocks
6      Machine
7      Machine
8       Ahraar
9      Android
10    Learning
11    Learning
12     Android
13     Machine
14       Rocks
15       Rocks
16    Learning
17      Ahraar
18    Learning
19     Machine
Name: name, dtype: object

In [21]:
df['temp']

0     43
1     99
2     70
3     72
4     26
5     74
6     72
7     76
8     99
9     50
10    27
11    44
12    27
13    80
14    90
15    64
16    90
17    70
18    83
19    81
Name: temp, dtype: int64

In [22]:
df['temp'].describe()

count    20.000000
mean     66.850000
std      23.179562
min      26.000000
25%      48.500000
50%      72.000000
75%      81.500000
max      99.000000
Name: temp, dtype: float64

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
temp      20 non-null int64
name      20 non-null object
random    20 non-null int64
dtypes: int64(2), object(1)
memory usage: 560.0+ bytes

In [24]:
df.values

array([[43, 'Learning', 13],
       [99, 'Learning', 12],
       [70, 'Rocks', 11],
       [72, 'Ahraar', 14],
       [26, 'Ahraar', 14],
       [74, 'Rocks', 11],
       [72, 'Machine', 11],
       [76, 'Machine', 10],
       [99, 'Ahraar', 11],
       [50, 'Android', 14],
       [27, 'Learning', 12],
       [44, 'Learning', 13],
       [27, 'Android', 10],
       [80, 'Machine', 14],
       [90, 'Rocks', 14],
       [64, 'Rocks', 10],
       [90, 'Learning', 12],
       [70, 'Ahraar', 11],
       [83, 'Learning', 12],
       [81, 'Machine', 13]], dtype=object)